Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Topics are divided into partitions. Each partition is an ordered, immutable sequence of records. Sending a message to a topic appends it to the selected partition. Each message from a partition gets a sequential id number called _offset_. It uniquely identifies each message within the partition. So, with Kafka, you can identify an individual record using a `<topic, partition, offset>` tuple.
ja_jp: トピックはパーティションに分割されます。各パーティションは、順序立てられた不変のレコードのシーケンスです。トピックにメッセージを送信すると、選択したパーティションにメッセージが追加されます。パーティションからの各メッセージは、 _offset_ と呼ばれる連続した ID 番号を取得します。これはパーティション内の各メッセージを一意に識別します。つまり、Kafka を使うと、 `<topic, partition, offset>` タプルを使って個々のレコードを識別することができます。

source: Topics related to using data sources with Quarkus
ja_jp: Quarkusでのデータソースの使用に関連するトピック

source: Total Builds
ja_jp: 合計ビルド数

source: Total duration
ja_jp: 合計期間

source: Towards faster builds
ja_jp: より高速なビルドに向けて

source: Trace your services with Jaeger
ja_jp: Jaeger を使ってサービスをトレースする

source: Traces
ja_jp: トレース

source: Traces output
ja_jp: トレース出力

source: Tracing
ja_jp: トレース

source: Tracing & Debugging
ja_jp: トレース & デバッグ

source: Tracing Agent Logging
ja_jp: 追跡エージェントロギング

source: Tracing additional methods
ja_jp: 追加メソッドのトレース

source: Tracing can be disabled explicitly per channel:
ja_jp: トレーシングはチャネルごとに明示的に無効にできます。

source: Tracing context
ja_jp: コンテキストの追跡

source: Tracing with AWS XRay and GraalVM
ja_jp: AWS XRay と GraalVM を使用したトレース

source: Tracing with OpenTelemetry
ja_jp: OpenTelemetryでトレース

source: Tracking build time configuration changes between builds
ja_jp: ビルド間のビルド時設定の変化の追跡

source: Tracking effective build time configuration used at build time
ja_jp: ビルド時に使用される有効なビルド時設定の追跡

source: Traditional EE patterns advise to split entity definition (the model) from the operations you can do on them (DAOs, Repositories), but really that requires a split between the state and its operations even though we would never do something like that for regular objects in the Object Oriented architecture, where state and methods are in the same class. Moreover, this requires two classes per entity, and requires injection of the DAO or Repository where you need to do entity operations, which breaks your edit flow and requires you to get out of the code you're writing to set up an injection point before coming back to use it.
ja_jp: 従来のEEパターンでは、エンティティの定義（モデル）とそれに対する操作（DAOやRepository）を分割することが推奨されていますが、 オブジェクト指向アーキテクチャでは、ステートとメソッドが同じクラスにある通常のオブジェクトに対してそのようなことをすることはないにもかかわらず、実際にはステートとその操作を分割する必要があります。 さらに、この場合、エンティティごとに2つのクラスが必要になり、エンティティの操作を行う必要がある場合にDAOやリポジトリをインジェクションする必要があるため、編集の流れが崩れ、注入ポイントを設定するために書いているコードから一度離れてから、注入ポイントを使用するためにまた戻ってくる必要があります。

source: Traditional EE patterns advise to split entity definition (the model) from the operations you can do on them (DAOs, Repositories), but really that requires a split between the state and its operations even though we would never do something like that for regular objects in the Object-Oriented architecture, where state and methods are in the same class. Moreover, this requires two classes per entity, and requires injection of the DAO or Repository where you need to do entity operations, which breaks your edit flow and requires you to get out of the code you're writing to set up an injection point before coming back to use it.
ja_jp: オブジェクト指向アーキテクチャの通常のオブジェクトでは、ステートとメソッドが同じクラスにないことはあり得ないのに、伝統的なEEパターンでは、エンティティの定義（モデル）とそれに対する操作（DAOやリポジトリ）を分けることが推奨されており、実際にはステートとその操作を分ける必要があります。さらに、エンティティごとに2つのクラスが必要になり、エンティティの操作を行う必要があるDAOやRepositoryをインジェクションする必要があるため、編集フローが崩れ、書いているコードから抜けてインジェクションポイントを設定してから戻って使用しなければなりません。

source: Traditional EE patterns advise to split entity definition (the model) from the operations you can do on them (DAOs, Repositories), but really that requires an unnatural split between the state and its operations even though we would never do something like that for regular objects in the Object Oriented architecture, where state and methods are in the same class. Moreover, this requires two classes per entity, and requires injection of the DAO or Repository where you need to do entity operations, which breaks your edit flow and requires you to get out of the code you're writing to set up an injection point before coming back to use it.
ja_jp: 従来のEEパターンでは、エンティティの定義（モデル）とそれに対する操作（DAOやリポジトリ）を分けることが推奨されていましたが、実際には、状態とその操作を不自然な形で分ける必要があります。状態とその操作が1つのクラスに存在するオブジェクト指向アーキテクチャでは通常そのようなことは行いません。さらに、エンティティごとに2つのクラスを必要とし、エンティティの操作を行う必要があるDAOやリポジトリをインジェクションする必要があります。これにより、編集フローが壊れ、インジェクションポイントを設定するために書いているコードから抜け出してから、それを使用するために戻ってこなければなりません。

source: Traditional EE patterns advise to split entity definition (the model) from the operations you can do on them (DAOs, Repositories), but really that requires an unnatural split between the state and its operations even though we would never do something like that for regular objects in the Object-Oriented architecture, where state and methods are in the same class. Moreover, this requires two classes per entity, and requires injection of the DAO or Repository where you need to do entity operations, which breaks your edit flow and requires you to get out of the code you're writing to set up an injection point before coming back to use it.
ja_jp: オブジェクト指向アーキテクチャの通常のオブジェクトでは、ステートとメソッドが同じクラスにないことはあり得ないのに、伝統的なEEパターンでは、エンティティの定義（モデル）とそれに対する操作（DAOやリポジトリ）を分けることが推奨されており、実際にはステートとその操作を不自然に分ける必要があります。さらに、エンティティごとに2つのクラスが必要になり、エンティティの操作を行う必要があるDAOやRepositoryをインジェクションする必要があるため、編集フローが崩れ、書いているコードから抜けてインジェクションポイントを設定してから戻って使用しなければなりません。

source: Traditional applications use blocking I/O and an imperative (sequential) execution model. So, in an application exposing an HTTP endpoint, each HTTP request is associated with a thread. In general, that thread is going to process the whole request and the thread is tied up serving only that request for the duration of that request. When the processing requires interacting with a remote service, it uses blocking I/O. The thread is blocked, waiting for the result of the I/O. While that model is simple to develop with (as everything is sequential), it has a few drawbacks. To handle concurrent requests, you need multiple threads, so, you need to introduce a worker thread pool. The size of this pool constrains the concurrency of the application. In addition, each thread has a cost in terms of memory and CPU. Large thread pools result in greedy applications.
ja_jp: 従来のアプリケーションは、ブロッキングI/Oと命令型（シーケンシャル）の実行モデルを採用しています。そのため、HTTPエンドポイントを公開するアプリケーションでは、各HTTPリクエストが1つのスレッドに関連付けられています。一般的には、そのスレッドはリクエスト全体を処理することになり、スレッドはそのリクエストの間、そのリクエストだけにサービスを提供することに縛られます。処理の中でリモートサービスとのやり取りが必要な場合は、ブロッキングI/Oを使用します。スレッドはブロックされ、I/Oの結果を待つことになります。このモデルは、すべてが逐次処理であるため、開発は簡単ですが、いくつかの欠点があります。同時リクエストを処理するには、複数のスレッドが必要になるため、ワーカースレッドプールを導入する必要があります。このプールのサイズは、アプリケーションの並行性を制約します。また、各スレッドにはメモリとCPUのコストがかかります。スレッドプールが大きいと、貪欲なアプリケーションになってしまいます。

source: Traditional blocking code uses link:https://docs.oracle.com/en/java/javase/11/docs/api/java.base/java/lang/ThreadLocal.html[`ThreadLocal`] variables to store contextual objects in order to avoid passing them as parameters everywhere. Many Quarkus extensions require those contextual objects to operate properly: xref:rest-json.adoc[RESTEasy Reactive], xref:cdi-reference.adoc[ArC] and xref:transaction.adoc[Transaction] for example.
ja_jp: 従来のブロッキングコードでは link:https://docs.oracle.com/en/java/javase/11/docs/api/java.base/java/lang/ThreadLocal.html[`ThreadLocal`]変数を使用してコンテキストオブジェクトを格納し、パラメータとして持ち回ることを避けていました。多くのQuarkusのエクステンションは、適切に動作するためにこれらのコンテキストオブジェクトを必要とします。例えば、 link:rest-json.html[RESTEasy]、 link:cdi-reference.html[ArC]、 link:transaction.html[Transaction]などです。

source: Traditional blocking code uses link:https://docs.oracle.com/en/java/javase/11/docs/api/java.base/java/lang/ThreadLocal.html[`ThreadLocal`] variables to store contextual objects in order to avoid passing them as parameters everywhere. Many Quarkus extensions require those contextual objects to operate properly: xref:rest-json.adoc[RESTEasy], xref:cdi-reference.adoc[ArC] and xref:transaction.adoc[Transaction] for example.
ja_jp: 従来のブロッキング・コードでは link:https://docs.oracle.com/en/java/javase/11/docs/api/java.base/java/lang/ThreadLocal.html[ThreadLocal] 変数を使用してコンテキストオブジェクトを保存します。Quarkusのエクステンションの多くは、適切に動作するためにコンテキストオブジェクトを必要とします：例えば、 xref:rest-json.adoc[RESTEasy] 、 xref:cdi-reference.adoc[ArC] 、 xref:transaction.adoc[Transaction] などです。

source: Traditional blocking code uses link:https://docs.oracle.com/en/java/javase/17/docs/api/java.base/java/lang/ThreadLocal.html[`ThreadLocal`] variables to store contextual objects in order to avoid passing them as parameters everywhere. Many Quarkus extensions require those contextual objects to operate properly: xref:rest-json.adoc[Quarkus REST (formerly RESTEasy Reactive)], xref:cdi-reference.adoc[ArC] and xref:transaction.adoc[Transaction] for example.
ja_jp: 従来のブロッキング・コードでは link:https://docs.oracle.com/en/java/javase/17/docs/api/java.base/java/lang/ThreadLocal.html[ThreadLocal] 変数を使用してコンテキストオブジェクトを保存します。 Quarkusのエクステンションの多くは、適切に動作するためにコンテキストオブジェクトを必要とします：例えば、 xref:rest-json.adoc[Quarkus REST（旧RESTEasy Reactive）] 、 xref:cdi-reference.adoc[ArC] 、 xref:transaction.adoc[Transaction] などです。

source: Traffic logging
ja_jp: トラフィックロギング

source: Traffic shaping allows you to limit the bandwidth across all channels (i.e. connections), regardless of the number of open channels. This can be useful when you want to control the overall network traffic to prevent congestion or prioritize certain types of traffic.
ja_jp: トラフィックシェーピングを使用すると、開いているチャネルの数に関係なく、すべてのチャネル（つまり接続）の帯域幅を制限することができます。 これは、ネットワーク全体のトラフィックを制御して輻輳を防止したり、特定の種類のトラフィックを優先したりする場合に便利です。

source: Training Data Preparation
ja_jp: トレーニングデータの準備

source: Training and AOT cache generation
ja_jp: トレーニングと AOT キャッシュの生成

source: Training during integration tests is not supported for AppCDS (only build-time generation)
ja_jp: 統合テスト中のトレーニングは AppCDS ではサポートされていません (ビルド時の生成のみ)

source: Training with integration tests
ja_jp: 統合テストによるトレーニング

source: Transaction Configuration
ja_jp: トランザクション設定

source: Transaction Manager integration
ja_jp: トランザクションマネージャーの統合

source: Transaction configuration
ja_jp: トランザクション設定

source: Transaction demarcation cannot be done using `jakarta.transaction.Transactional` or `QuarkusTransaction`; if you use xref:hibernate-reactive-panache.adoc[Hibernate Reactive with Panache], consider xref:hibernate-reactive-panache.adoc#transactions[using `@WithTransaction` or `Panache.withTransaction()`] instead.
ja_jp: トランザクションの分割は、 `jakarta.transaction.Transactional` または `QuarkusTransaction` を使用して行うことはできません。 xref:hibernate-reactive-panache.adoc[Hibernate Reactive with Panache] を使用する場合は、 代わりに xref:hibernate-reactive-panache.adoc#transactions[@WithTransaction またはPanache.withTransaction() を使用する] ことを検討してください。

source: Transaction execution can be conditioned by _keys_. When a passed key gets modified during the execution of a transaction, the transaction is discarded. The keys are passed as `String` as a second parameter to the `withTransaction` method:
ja_jp: トランザクションの実行は、_キー_ によって条件付けることができます。渡されたキーがトランザクションの実行中に変更された場合、トランザクションは破棄されます。キーは `withTransaction` メソッドの第 2 パラメーターとして `String` として渡されます。

source: Transaction execution can be conditioned by _keys_. When a passed key gets modified during the execution of a transaction, the transaction is discarded. The keys are passed as ``String``s to the second, vararg parameter of the `withTransaction` method:
ja_jp: トランザクションの実行は、 _キー_ によって条件付けられます。 トランザクションの実行中に渡されたキーが変更されると、トランザクションは破棄されます。 キーは `withTransaction` メソッドの 2 番目の可変引数パラメーターに ``String`` として渡されます。

source: Transaction support inside MongoDB with Panache is still experimental.
ja_jp: MongoDB with Panache内部のトランザクションサポートはまだ実験的なものです。

source: Transaction-aware consumers
ja_jp: トランザクションを意識したコンシューマー

source: Transactional and Idempotent producers support
ja_jp: トランザクションとべき等プロデューサーのサポート

source: Transactions
ja_jp: トランザクション

source: Transactions allow one or multiple producers to send batch of messages to multiple topics where all messages in the batch are eventually visible to any consumer, or none is ever visible to consumers.
ja_jp: トランザクションを使用すると、1 つまたは複数のプロデューサーが複数のトピックにメッセージのバッチを送信できるようになります。バッチ内のすべてのメッセージが、最終的にすべてのコンシューマーにみえるか、またはコンシューマーに一切みえなくなります。

source: Transactions are not supported for Reactive Entities and Repositories.
ja_jp: トランザクションは、Reactive エンティティおよびRepositoryではサポートされていません。

source: Transactions in Redis Cluster
ja_jp: Redis Cluster におけるトランザクション

source: Transform the `io.vertx.mutiny.sqlclient.RowSet` to a `Multi<Row>`.
ja_jp: `io.vertx.mutiny.sqlclient.RowSet` を `Multi<Row>` に変換します。。

source: Transform the event into another event using a synchronous function. The downstream receives the result of the function (or a failure if the transformation failed).
ja_jp: 同期関数を使って、イベントを別のイベントに変換します。 ダウンストリームは、関数の結果（変換に失敗した場合は失敗）を受け取ります。

source: Transform the event into another event using an asynchronous function. The downstream receives the item emitted by the produced Uni (or a failure if the transformation failed). If the produced Uni emits a failure, that failure is passed to the downstream.
ja_jp: 非同期関数を使って、イベントを別のイベントに変換する。下流側は、生成されたUniが発するアイテム（変換に失敗した場合は失敗）を受け取ります。生成されたUniが失敗を発した場合、その失敗は下流に渡されます。

source: Transforming an item is done using: `onItem().transform(item -> ....)`.
ja_jp: アイテムの変換には `onItem().transform(item -> …​.)` を使用します。

source: Transforming item
ja_jp: アイテムのトランスフォーム

source: Transitioning to an hybrid cloud deployment model.
ja_jp: ハイブリッドクラウドのデプロイモデルへの移行

source: Translation file format
ja_jp: 翻訳ファイルの形式

source: Translation file layout
ja_jp: 翻訳ファイルのレイアウト

source: Trigger a build and deployment in a single step:
ja_jp: ビルドとデプロイをワンステップでトリガーします：

source: Trigger a login
ja_jp: ログインをトリガーする

source: Trigger a registration
ja_jp: 登録をトリガーする

source: Trigger the inclusion on additional extensions based on certain conditions.
ja_jp: 特定の条件に基づいて、追加のエクステンションを含めることをトリガー出来ます。

source: Triggering Live Reload
ja_jp: ライブリロードのトリガー

source: Triggers
ja_jp: トリガー

source: Troubleshooting
ja_jp: トラブルシューティング

source: Troubleshooting / Debugging Tips
ja_jp: トラブルシューティング / デバッグのヒント

source: Troubleshooting exceptions and stack traces
ja_jp: 例外やスタックトレースのトラブルシューティング

source: Trust all the hostnames. If the keys have to be fetched over `HTTPS` and this property is set to `true` then all the hostnames are trusted by default.
ja_jp: すべてのホスト名を信頼します。キーを `HTTPS` 経由でフェッチする必要があり、このプロパティーが `true` に設定されている場合、デフォルトですべてのホスト名が信頼されます。

source: Trust store certificate alias
ja_jp: トラストストアの証明書エイリアス

source: Trust store file
ja_jp: トラストストアファイル

source: Trust store file type
ja_jp: トラストストアファイルのタイプ

source: Trust store password
ja_jp: トラストストアのパスワード

source: Trust stores
ja_jp: トラストストア

source: Trust stores are used to store the certificates of the trusted parties. In regular TLS, the client uses a truststore to authenticate the server. With mutual TLS (mTLS), both the server and the client use truststores to authenticate each other.
ja_jp: トラストストアは、信頼できる当事者の証明書を保存するために使用されます。 通常の TLS では、クライアントがトラストストアを使用してサーバーを認証します。 相互 TLS (mTLS) では、サーバーとクライアントの両方がトラストストアを使用して相互に認証します。

source: Trusting all certificates and Disabling SSL hostname verification
ja_jp: すべての証明書を信頼し、SSL ホスト名検証を無効にする

source: Trusting all certificates and hostname verification
ja_jp: すべての証明書とホスト名の検証を信頼する

source: Trusting all certificates ignores certificate validation, so the client trusts all certificates. This method is useful for testing with self-signed certificates, but do not use it in production.
ja_jp: すべての証明書を信頼すると証明書の検証が無視されるため、クライアントはすべての証明書を信頼します。この方法は自己署名証明書を使用したテストには便利ですが、本番環境では使用しないでください。

source: Trusting all certificates ignores the certificate validation, so all certificates are trusted. This method is useful for testing with self-signed certificates, but it should not be used in production.
ja_jp: すべての証明書を信頼すると、証明書の検証が無視されるため、すべての証明書が信頼されます。 この方法は自己署名証明書を使用したテストには便利ですが、実稼働環境では使用しないでください。

source: Trusting the Certificate Authority (CA)
ja_jp: 認証局 (CA) を信頼する

source: Try out 1.0.0.Alpha1 and let us know how it works for your agent use cases!
ja_jp: 1.0.0.Alpha1 を試して、エージェントのユースケースにどのように機能するかをお知らせください。

source: Try out the updated endpoint by visiting http://localhost:8080/hello?name=Bloom. You should see a "Hello Bloom" message.
ja_jp: http://localhost:8080/hello?name=Bloom にアクセスして、更新されたエンドポイントを試してください。 "Hello Bloom" というメッセージが表示されます。

source: Try the application
ja_jp: アプリケーションの試行

source: Try the following sequence and look for `example_prime_number_total` in the plain text output.
ja_jp: 以下のシーケンスを試して、プレーンテキストの出力で `example_prime_number_total` を確認してください。

source: Try the following sequence and look for the following entries in the plain text output:
ja_jp: 以下のシーケンスを試して、プレーンテキストの出力で次のエントリーを確認してください。

source: Try to write the abstract by using the following guidelines:
ja_jp: 以下のガイドラインを参考にして、要約を書くようにしてください:

source: Trying out Quarkus 3
ja_jp: Quarkus 3を試してみる

source: Trying out your services manually
ja_jp: 手動でサービスを試す

source: Trying the application
ja_jp: アプリケーションを試す

source: Tuning of Cache Regions
ja_jp: キャッシュ領域の調整

source: Tuning the generated resources using application.properties
ja_jp: application.properties を使用して生成されたリソースをチューニングする

source: Turn off section numbering
ja_jp: セクション番号付けをオフにします。

source: Tutorial
ja_jp: チュートリアル

source: Tutorials
ja_jp: チュートリアル

source: Tutorials are _lessons_ that take the reader by the hand through a series of steps to complete a project of some kind. Tutorials are _learning-oriented_.
ja_jp: チュートリアルは、読者に、あるプロジェクトを完了するための一連の手順を示します。チュートリアルは _学習を重視_ しています。

source: Tutorials should end in `-tutorial.adoc`
ja_jp: チュートリアルは `-tutorial.adoc` で終わる必要があります。

source: Twitter doesn't require https usage in practice, but won't accept your `Website URL` without it, so you can still use ngrok for it.
ja_jp: Twitter は実際には https を使用する必要はありませんが、 https がないと `Website URL` を受け入れないため、ngrok を引き続き使用できます。

source: Two additional files are needed in your application's root directory:
ja_jp: アプリケーションのルートディレクトリには、2つの追加ファイルが必要です。

source: Two components are necessary to write these tests:
ja_jp: これらのテストを書くには、2つの要素が必要です。

source: Two important regressions fixed
ja_jp: 2つの重要なリグレッションの修正

source: Two new registries were added:
ja_jp: 新たに2つのレジストリーが追加されました:

source: Two of the metadata files have the same name but different extensions, `quarkus-extension.yaml` and `quarkus-extension.properties`. It is easy to mix them up, be careful. You will usually edit the YAML file and track it in your SCM. While you _can_ manually manage the properties file, Quarkus will generate it at build if you don't.
ja_jp: メタデータファイルのうち 2 つは、 `quarkus-extension.yaml` と `quarkus-extension.properties` という同じ名前ですが、拡張子が異なります。これらは混同しやすいので注意してください。通常は YAML ファイルを編集し、SCM で追跡します。プロパティーファイルは手動で管理できますが、そうしない場合は Quarkus がビルド時に生成します。

source: Two of the metadata files have the same name but different extensions, `quarkus-extension.yaml` and `quarkus-extension.properties`. It is easy to mix them up, be careful. You will usually edit the YAML file and track it in your SCM. While you _can_ manually manage the properties file, Quarkus will generated it at build if you don't.
ja_jp: 2つのメタデータファイルは同じ名前ですが、 `quarkus-extension.yaml` と `quarkus-extension.properties` という異なるエクステンションを持っています。 混同しやすいので注意してください。通常、YAMLファイルを編集し、SCMで追跡します。 プロパティファイルは手動で管理 _してもよい_ ですが、そうしなかった場合はQuarkusがビルド時に生成します。

source: Two things are certain in the life of a developer: Java and Taxes.
ja_jp: 開発者の人生には確かなことが2つあります。Javaと税金です。

source: Two types of GraphQL clients are supported.
ja_jp: 2種類のGraphQLクライアントに対応しています。

source: Type
ja_jp: タイプ

source: Type safety and performance: Quarkus Chicory generates Java bytecode from WASM modules
ja_jp: 型安全性とパフォーマンス: Quarkus Chicory が WASM モジュールから Java バイトコードを生成します。

source: Type-Safe Message Bundles partial support
ja_jp: タイプセーフ・メッセージ・バンドルの部分サポート

source: Type-safe Expressions
ja_jp: タイプセーフな式

source: Type-safe Fragment Call Site Example
ja_jp: タイプセーフフラグメントコールサイト例

source: Type-safe Fragment Example
ja_jp: タイプセーフフラグメントの例

source: Type-safe Fragments
ja_jp: タイプセーフフラグメント

source: Type-safe Message Bundles
ja_jp: タイプセーフメッセージバンドル

source: Type-safe Template Definition
ja_jp: タイプセーフテンプレート定義

source: Type-safe Templates
ja_jp: タイプセーフテンプレート

source: Type-safe resolution
ja_jp: タイプセーフ解決

source: Type-safe template using `@CheckedTemplate` are currently only supported for the default mailer configuration.
ja_jp: `@CheckedTemplate` を使用したタイプセーフテンプレートは、現在、デフォルトのメーラー設定にのみ対応しています。

source: Type-safe templates
ja_jp: タイプセーフテンプレート

source: Type-safety
ja_jp: タイプセーフ

source: Types for which a link:{jaxrsapi}/jakarta/ws/rs/ext/ParamConverter.html[`ParamConverter`] is available via a registered link:{jaxrsapi}/jakarta/ws/rs/ext/ParamConverterProvider.html[`ParamConverterProvider`].
ja_jp: link:{jaxrsapi}/jakarta/ws/rs/ext/ParamConverterProvider.html[`ParamConverterProvider`] を通じて登録済の link:{jaxrsapi}/jakarta/ws/rs/ext/ParamConverter.html[`ParamConverter`] が存在する型

source: Types for which a link:{jaxrsapi}/javax/ws/rs/ext/ParamConverter.html[`ParamConverter`] is available via a registered link:{jaxrsapi}/javax/ws/rs/ext/ParamConverterProvider.html[`ParamConverterProvider`].
ja_jp: link:{jaxrsapi}/javax/ws/rs/ext/ParamConverterProvider.html[`ParamConverterProvider`] を通じて登録済の link:{jaxrsapi}/javax/ws/rs/ext/ParamConverter.html[`ParamConverter`] が存在する型

source: Types that have a constructor that accepts a single link:{jdkapi}/java/lang/String.html[`String`] argument.
ja_jp: 単一の link:{jdkapi}/java/lang/String.html[`String`] 引数を受け入れるコンストラクターを持つ型。

source: Types that have a static method named `valueOf` or `fromString` with a single link:{jdkapi}/java/lang/String.html[`String`] argument that return an instance of the type. If both methods are present then `valueOf` will be used unless the type is an `enum` in which case `fromString` will be used.
ja_jp: link:{jdkapi}/java/lang/String.html[`String`] という引数を持ち、その型のインスタンスを返す `valueOf` または `fromString` という名前の静的メソッドを持っている型。両方のメソッドが存在する場合は、 `valueOf` が使用されます。ただし、その型が `enum` の場合は `fromString` が使用されます。

source: Types that support coercion include `BigInteger`, `Integer`, `Long`, `Double`, `Float` and `String`.
ja_jp: 強制変換をサポートする型には、`BigInteger`、`Integer`、`Long`、`Double`、`Float`、`String` などがあります。

source: Typical property combinations
ja_jp: 典型的なプロパティーの組み合わせ

source: Typically AWS Lambda creates a new execution environment when invoking a new function for the first time or when it is scaled up to handle the traffic. SnapStart takes a different approach by taking a snapshot of the execution environment(memory and application state) of the initialized function execution environment. Furthermore, it persists the snapshot and caches it for low-latency access. When invoking the function, it does not need to spend time initializing code, dependencies, or framework. Instead, Lambda resumes the new execution environment from the persisted snapshot.
ja_jp: 通常、AWS Lambdaは新しい関数を初めて呼び出すときや、トラフィックを処理するためにスケールアップするときに、新しい実行環境を作成します。SnapStartは、初期化された関数の実行環境（メモリやアプリケーションの状態）のスナップショットを取得することで、異なるアプローチを取ります。さらに、そのスナップショットを永続化し、低レイテンシーでアクセスできるようにキャッシュします。関数を呼び出す際、コードや依存関係、フレームワークの初期化に時間を費やす必要はありません。その代わり、Lambdaは永続化されたスナップショットから新しい実行環境を再開します。

source: Typically one is loading a configuration to create some runtime component/service as `parseServiceXmlConfig` is doing. We will come back to the rest of the behavior in `parseServiceXmlConfig` in the following <<Manage Non-CDI Service>> section.
ja_jp: 一般的には、 `parseServiceXmlConfig` が行っているように、何らかの実行時コンポーネント/サービスを作成するために設定を読み込むことが多い。 `parseServiceXmlConfig` の残りの動作については、次の <<Manage Non-CDI Service>> のセクションで説明します。
